tutorials/PFB_2D_Mooring/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    "(inlet|outlet|atmosphere)"
    {
        type            inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }

    "(stationaryWalls|floatingObject)"
    {
        type            omegaWallFunction;
        value           uniform 100;
    }

    frontAndback
    {
        type            empty;
    }
}

// ************************************************************************* //